class Strings:
    START = """Привет! 👋
Этот бот🤖 поможет Вам запомнить имена и лица👩👨 ваших коллег, знакомых, одноклассников и всех кого захотите. 
Для полной информацииℹ️ введите команду /help
Удачного использования😀"""
    GOT_PHOTO = "Фото успешно сохранено в вашу коллекцию👍. Продолжайте в том же духе😃"
    GOT_NAME = "Имя успешно сохранено👍. Продолжайте присылать фотографии😃"
    ASK_PHOTO = "Присылайте фотографии📷 людей с подписанными именами по одной. Когда закончите, введите команду /cancel"
    CANCEL = "Операция отменена⛔️"
    EMPTY_LIST = "Пустая коллекция, невозможно начать викторину☹️"
    PREV = "⬅️"
    NEXT = "➡️"
    FINISH = "Результаты🏁"
    CANCEL_QUIZ = "Отменить викторину🚫"
    CANCEL_PHOTO = "Фото пропущено, присылайте фотографии дальше😀"
    END_GET = "Закончить просмотр"
    FINISH_GET = "Просмотр коллекции закончен🤓"
    SELECT = "Упс. Кажется, Вы забыли ответить☹️"
    EMPTY_NAME = "Вы забыли указать имя. Пришлите его без фотографии или введите команду /cancel_photo, после чего продолжайте присылать фотографии😉 "
    OLD_NAME = """Вы уже присылали фотографию человека с таким именем😐.
Если имя указано неверно, пришлите правильное, если не та фотография, пришлите новую😊 или введите команду /cancel_photo, чтобы пропустить это фото"""
    HELP = """TODO"""
    RESULT = """Поздравляем!🎉 Вы закончили викторину!
Ваш результат...

"""
    BAD_RESULT = "Неплохо, но старайтесь еще, Вы молодец!👍"
    GOOD_RESULT = "Хороший результат, очень впечатляет!🔥🔥🔥"
    SUPER_RESULT = "Великолепный результат! Добавить больше нечего! Вы гений!🏆🏆🏆"
